# DegreeC Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DegreeC Property
SymbolTypeId Class See Also
---
Symbol °C, indicating unit Celsius.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DegreeC { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DegreeC As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DegreeC {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace